# What is groupby in pandas: 

The groupby() method in pandas is used to split data into groups based on one or more columns.
It allows performing operations like sum, mean, count, etc., on each group separately.
It returns a GroupBy object that can be iterated or aggregated.

## Why & When to Use (Concise List):

a. When summarizing data by category (e.g., total sales per region)

b. For aggregation (sum, mean, min, max, etc.)

c. For transforming or filtering groups

d. Useful in pivot-style reporting or statistical analysis

e. Essential for time-series, customer segmentation, and reporting tasks


### We will ask from dataset

 1. How many passengers survived in each class?
 
 2. What is the average age of passengers by gender?
 
 3. How many passengers are there per embarkation port?
  
 4. What is the average fare paid by class and gender?
 
 5. How many siblings/spouses aboard per class?
  
 6. What is the maximum fare in each passenger class?
 
 7. What is the mean and std of age by survival?
 
 8. Find the oldest and youngest passengers in each passenger class


 9. Calculate total fare and average age for each embarked port


 10. Find the Most Common Embarked Port for each Passenger Class:

 11. Calculate the Age Range (Max - Min) for each Title (Mr, Mrs, etc.):
 
 
 ### Bonus Question (12, 13, 14)

In [42]:
import pandas as pd 
df = pd.read_csv("lec 17, dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

#  1. How many passengers survived in each class?

In [43]:
df.groupby("Pclass")['Survived'].sum()

Pclass
1    50
2    30
3    72
Name: Survived, dtype: int64

# 2. What is the average age of passengers by gender?

In [44]:
df.groupby('Sex')['Age'].mean()

Sex
female    30.272362
male      30.272732
Name: Age, dtype: float64

# 3. How many passengers are there per embarkation port?

In [45]:
df.groupby('Embarked')['PassengerId'].count()

Embarked
C    102
Q     46
S    270
Name: PassengerId, dtype: int64

# 4. What is the average fare paid by class and gender?

In [46]:
df.groupby(['Pclass','Sex'])['Fare'].mean()

Pclass  Sex
1       female    115.591168
        male       75.586551
2       female     26.438750
        male       20.184654
3       female     13.735129
        male       11.826350
Name: Fare, dtype: float64

# 5. How many siblings/spouses aboard per class?

In [47]:
df.groupby('Pclass')['SibSp'].sum()

Pclass
1     51
2     35
3    101
Name: SibSp, dtype: int64

# 6. What is the maximum fare in each passenger class?

In [48]:
df.groupby('Pclass')['Fare'].max()

Pclass
1    512.3292
2     73.5000
3     69.5500
Name: Fare, dtype: float64

# 7 What is the mean and std of age by survival?

In [49]:
df.groupby('Survived')['Age'].agg(['mean', 'std'])

               mean        std
Survived
0         30.272732  13.389528
1         30.272362  15.428613

#  8. Find the oldest and youngest passengers in each passenger class

In [50]:
df.groupby('Pclass')['Age'].agg(['max','min'])

         max   min
Pclass
1       76.0  6.00
2       63.0  0.92
3       60.5  0.17

# 9. Calculate total fare and average age for each embarked port

In [51]:
df.groupby('Embarked').agg({'Fare':'sum', 'Age':'mean'})

               Fare        Age
Embarked
C         6758.4960  34.737805
Q          504.0542  29.318182
S         7593.9874  28.758772

#  10. Find the Most Common Embarked Port for each Passenger Class

In [52]:
df.groupby("Pclass")['Embarked'].apply(lambda x: x.mode().iloc[0])

Pclass
1    C
2    S
3    S
Name: Embarked, dtype: object

# 11. Calculate the Age Range (Max - Min) for each Title (Mr, Mrs, etc.):

In [53]:
df['title'] = df['Name'].str.extract('([A-Za-z]+)\.')

df.groupby('title')['Age'].agg(lambda x: x.max() - x.min())

title
Col        6.00
Dona       0.00
Dr         0.00
Master    14.17
Miss      44.83
Mr        53.00
Mrs       60.00
Ms          NaN
Rev       11.00
Name: Age, dtype: float64

# 12. Group Passengers by Age Range and Calculate the Survival Rate:

In [54]:
# Group passengers by age range and calculate survival rate
age_bins = [0, 18, 30, 50, 100]
age_labels = ['0-18', '19-30', '31-50', '51+']
df['AgeRange'] = pd.cut(df['Age'], bins=age_bins, labels=age_labels)

In [55]:
age_bins = [0, 18, 30, 50, 100]
age_labels = ['0-18', '19-30', '31-50','51+']

df['AgeRange'] = pd.cut(df['Age'], bins=age_bins, labels=age_labels)

In [56]:
df.groupby('AgeRange')['Survived'].mean() * 100

C:\Users\Noor Saeed\AppData\Local\Temp\ipykernel_18232\844689211.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('AgeRange')['Survived'].mean() * 100

AgeRange
0-18     44.444444
19-30    36.301370
31-50    34.653465
51+      48.387097
Name: Survived, dtype: float64

# 13. Find the Passengers with the Highest Fare in each Age Group:

In [57]:
# Create age bins and labels
age_bins = [0, 18, 30, 50, 100]
age_labels = ['0-18', '19-30', '31-50', '51+'] 
df['agegroup'] = pd.cut(df['Age'],bins=age_bins,labels=age_labels)
df['agegroup']

0      31-50
1      31-50
2        51+
3      19-30
4      19-30
       ...
413      NaN
414    31-50
415    31-50
416      NaN
417      NaN
Name: agegroup, Length: 418, dtype: category
Categories (4, object): ['0-18' < '19-30' < '31-50' < '51+']

In [58]:
df.loc[df.groupby('agegroup', observed=True)['Fare'].idxmax().dropna()][['Name', 'Fare']]

                                                  Name      Fare
64                         Ryerson, Master. John Borie  262.3750
53                          Fortune, Miss. Ethel Flora  263.0000
24     Ryerson, Mrs. Arthur Larned (Emily Maria Borie)  262.3750
343  Cardeza, Mrs. James Warburton Martinez (Charlo...  512.3292

# 14. Find the Most Common Ticket Number for each Passenger Name :

In [59]:
# Find the most common ticket number for each passenger name prefix
df.groupby('Name')['Ticket'].apply(lambda x: x.mode().iloc[0])

Name
Abbott, Master. Eugene Joseph                           C.A. 2673
Abelseth, Miss. Karen Marie                                348125
Abelseth, Mr. Olaus Jorgensen                              348122
Abrahamsson, Mr. Abraham August Johannes         SOTON/O2 3101284
Abrahim, Mrs. Joseph (Sophie Halaut Easu)                    2657
                                                       ...
de Brito, Mr. Jose Joaquim                                 244360
de Messemaeker, Mr. Guillaume Joseph                       345572
del Carlo, Mrs. Sebastiano (Argenia Genovesi)       SC/PARIS 2167
van Billiard, Master. James William                      A/5. 851
van Billiard, Master. Walter John                        A/5. 851
Name: Ticket, Length: 418, dtype: object